Repository: rodgav/user_cedtodo
Catalog: lib/startapp/internationalization/l10n/intl_*.arb
Languages: es

# general_mock
source: General errors thrown by the mock controller used for testing.
es: Errores generales lanzados por el controlador simulado utilizado para la prueba.

# general_argument_invalid
source: The request contains one or more invalid arguments. Please refer to the endpoint documentation.
es: La solicitud contiene uno o más argumentos no válidos. Consulte la documentación del punto final.

# general_query_limit_exceeded
source: Query limit exceeded for the current attribute. Usage of more than 100 query values on a single attribute is prohibited.
es: Se excedió el límite de consultas para el atributo actual. Está prohibido el uso de más de 100 valores de consulta en un solo atributo.

# general_query_invalid
source: The query's syntax is invalid. Please check the query and try again.
es: La sintaxis de la consulta no es válida. Verifique la consulta y vuelva a intentarlo.

# general_cursor_not_found
source: The cursor is invalid. This can happen if the item represented by the cursor has been deleted.
es: El cursor no es válido. Esto puede ocurrir si se ha eliminado el elemento representado por el cursor.

# user_password_mismatch
source: Passwords do not match. Please check the password and confirm password.
es: Las contraseñas no coinciden. Por favor verifique la contraseña y confirme la contraseña.

# user_phone_not_found
source: The current user does not have a phone number associated with their account.
es: El usuario actual no tiene un número de teléfono asociado a su cuenta.

# user_missing_id
source: Missing ID from OAuth2 provider.
es: Falta el ID del proveedor de OAuth2.

# storage_device_not_found
source: The requested storage device could not be found.
es: No se pudo encontrar el dispositivo de almacenamiento solicitado.

# storage_file_empty
source: Empty file passed to the endpoint.
es: Archivo vacío pasado al punto final.

# storage_file_type_unsupported
source: The given file extension is not supported.
es: La extensión de archivo proporcionada no es compatible.

# storage_invalid_file_size
source: The file size is either not valid or exceeds the maximum allowed size. Please check the file or the value of the _APP_STORAGE_LIMIT environment variable.
es: El tamaño del archivo no es válido o supera el tamaño máximo permitido. Verifique el archivo o el valor de la variable de entorno _APP_STORAGE_LIMIT.

# storage_invalid_content_range
source: The content range is invalid. Please check the value of the Content-Range header.
es: El rango de contenido no es válido. Verifique el valor del encabezado Content-Range.

# build_not_ready
source: Build with the requested ID is building and not ready for execution.
es: La compilación con el ID solicitado se está compilando y no está lista para ejecutarse.

# build_in_progress
source: Build with the requested ID is already in progress. Please wait before you can retry.
es: La compilación con el ID solicitado ya está en curso. Espere antes de poder volver a intentarlo.

# collection_limit_exceeded
source: The maximum number of collections has been reached.
es: Se ha alcanzado el número máximo de colecciones.

# document_invalid_structure
source: The document structure is invalid. Please ensure the attributes match the collection definition.
es: La estructura del documento no es válida. Asegúrese de que los atributos coincidan con la definición de la colección.

# document_missing_payload
source: The document payload is missing.
es: Falta la carga del documento.

# attribute_unknown
source: The attribute required for the index could not be found. Please confirm all your attributes are in the available state.
es: No se pudo encontrar el atributo requerido para el índice. Por favor, confirme que todos sus atributos están en eldisponibleestado.

# attribute_not_available
source: The requested attribute is not yet available. Please try again later.
es: El atributo solicitado aún no esdisponible. Por favor, inténtelo de nuevo más tarde.

# attribute_format_unsupported
source: The requested attribute format is not supported.
es: El formato de atributo solicitado no es compatible.

# attribute_default_unsupported
source: Default values cannot be set for array and required attributes.
es: Los valores predeterminados no se pueden establecer paraformaciónyrequeridoatributos

# attribute_limit_exceeded
source: The maximum number of attributes has been reached.
es: Se ha alcanzado el número máximo de atributos.

# attribute_value_invalid
source: The attribute value is invalid. Please check the type: range and value of the attribute.
es: El valor del atributo no es válido. Compruebe el tipo, el rango y el valor del atributo.

# index_limit_exceeded
source: The maximum number of indexes has been reached.
es: Se ha alcanzado el número máximo de índices.

# project_unknown
source: The project ID is either missing or not valid. Please check the value of the X-Appwrite-Project header to ensure the correct project ID is being used.
es: Falta el ID del proyecto o no es válido. Compruebe el valor del encabezado X-Appwrite-Project para asegurarse de que se está utilizando el ID de proyecto correcto.

# project_invalid_success_url
source: Invalid redirect URL for OAuth success.
es: URL de redirección no válida para el éxito de OAuth.

# project_invalid_failure_url
source: Invalid redirect URL for OAuth failure.
es: URL de redirección no válida por falla de OAuth.

# project_reserved_project
source: The project ID is reserved. Please choose another project ID.
es: El ID del proyecto está reservado. Elija otro ID de proyecto.

# general_access_forbidden
source: Access to this API is forbidden.
es: El acceso a esta API está prohibido.

# general_unauthorized_scope
source: The current user or API key does not have the required scopes to access the requested resource.
es: El usuario actual o la clave de API no tiene los ámbitos necesarios para acceder al recurso solicitado.

# user_jwt_invalid
source: The JWT token is invalid. Please check the value of the X-Appwrite-JWT header to ensure the correct token is being used.
es: El token JWT no es válido. Verifique el valor del encabezado X-Appwrite-JWT para asegurarse de que se esté utilizando el token correcto.

# user_blocked
source: The current user has been blocked. You can unblock the user from the Appwrite console.
es: El usuario actual ha sido bloqueado. Puede desbloquear al usuario desde la consola de Appwrite.

# user_invalid_token
source: Invalid token passed in the request.
es: Token no válido pasado en la solicitud.

# user_email_not_whitelisted
source: Console registration is restricted to specific emails. Contact your administrator for more information.
es: El registro de la consola está restringido a correos electrónicos específicos. Póngase en contacto con su administrador para obtener más información.

# user_ip_not_whitelisted
source: Console registration is restricted to specific IPs. Contact your administrator for more information.
es: El registro de la consola está restringido a direcciones IP específicas. Póngase en contacto con su administrador para obtener más información.

# user_invalid_credentials
source: Invalid credentials. Please check the email and password.
es: Credenciales no válidas. Por favor, compruebe el correo electrónico y la contraseña.

# user_anonymous_console_prohibited
source: Anonymous users cannot be created for the console project.
es: No se pueden crear usuarios anónimos para el proyecto de consola.

# user_session_already_exists
source: Creation of anonymous users is prohibited when a session is active.
es: Está prohibida la creación de usuarios anónimos cuando una sesión está activa.

# user_unauthorized
source: The current user is not authorized to perform the requested action.
es: El usuario actual no está autorizado para realizar la acción solicitada.

# team_invalid_secret
source: The team invitation secret is invalid.
es: El secreto de invitación del equipo no es válido.

# team_invite_mismatch
source: The invite does not belong to the current user.
es: La invitación no pertenece al usuario actual.

# project_key_expired
source: The project key has expired. Please generate a new key using the Appwrite console.
es: La clave del proyecto ha caducado. Genere una clave nueva mediante la consola de Appwrite.

# domain_verification_failed
source: Domain verification for the requested domain has failed.
es: La verificación de dominio para el dominio solicitado ha fallado.

# general_unknown_origin
source: The request originated from an unknown origin. If you trust this domain: please list it as a trusted platform in the Appwrite console.
es: La solicitud se originó de un origen desconocido. Si confía en este dominio, inclúyalo como plataforma de confianza en la consola de Appwrite.

# storage_invalid_file
source: The uploaded file is invalid. Please check the file and try again.
es: El archivo subido no es válido. Verifique el archivo y vuelva a intentarlo.

# general_route_not_found
source: The requested route was not found. Please refer to the docs and try again.
es: No se encontró la ruta solicitada. Consulte los documentos y vuelva a intentarlo.

# user_not_found
source: User with the requested ID could not be found.
es: No se pudo encontrar el usuario con la ID solicitada.

# user_session_not_found
source: The current user session could not be found.
es: No se pudo encontrar la sesión de usuario actual.

# team_not_found
source: Team with the requested ID could not be found.
es: No se pudo encontrar el equipo con la ID solicitada.

# team_invite_not_found
source: The requested team invitation could not be found.
es: No se pudo encontrar la invitación del equipo solicitado.

# team_membership_mismatch
source: The membership ID does not belong to the team ID.
es: La identificación de membresía no pertenece a la identificación del equipo.

# membership_not_found
source: Membership with the requested ID could not be found.
es: No se pudo encontrar la membresía con la identificación solicitada.

# avatar_set_not_found
source: The requested avatar set could not be found.
es: No se pudo encontrar el conjunto de avatar solicitado.

# avatar_not_found
source: The request avatar could not be found.
es: No se pudo encontrar el avatar de la solicitud.

# avatar_image_not_found
source: The requested image was not found at the URL.
es: La imagen solicitada no se encontró en la URL.

# avatar_remote_url_failed
source: Failed to fetch favicon from the requested URL.
es: No se pudo obtener el favicon de la URL solicitada.

# avatar_icon_not_found
source: The requested favicon could not be found.
es: No se pudo encontrar el favicon solicitado.

# storage_file_not_found
source: The requested file could not be found.
es: No se pudo encontrar el archivo solicitado.

# storage_bucket_not_found
source: Storage bucket with the requested ID could not be found.
es: No se pudo encontrar el depósito de almacenamiento con el ID solicitado.

# function_not_found
source: Function with the requested ID could not be found.
es: No se pudo encontrar la función con el ID solicitado.

# function_runtime_unsupported
source: The requested runtime is either inactive or unsupported. Please check the value of the _APP_FUNCTIONS_RUNTIMES environment variable.
es: El tiempo de ejecución solicitado está inactivo o no es compatible. Verifique el valor de la variable de entorno _APP_FUNCTIONS_RUNTIMES.

# build_not_found
source: Build with the requested ID could not be found.
es: No se pudo encontrar la compilación con el ID solicitado.

# deployment_not_found
source: Deployment with the requested ID could not be found.
es: No se pudo encontrar la implementación con el ID solicitado.

# execution_not_found
source: Execution with the requested ID could not be found.
es: No se pudo encontrar la ejecución con el ID solicitado.

source: Database not found
es: Base de datos no encontrada

# collection_not_found
source: Collection with the requested ID could not be found.
es: No se ha podido encontrar la colección con el ID solicitado.

# document_not_found
source: Document with the requested ID could not be found.
es: No se ha podido encontrar el documento con el ID solicitado.

# attribute_not_found
source: Attribute with the requested ID could not be found.
es: No se pudo encontrar el atributo con el ID solicitado.

# index_not_found
source: Index with the requested ID could not be found.
es: No se pudo encontrar el índice con el ID solicitado.

# project_not_found
source: Project with the requested ID could not be found. Please check the value of the X-Appwrite-Project header to ensure the correct project ID is being used.
es: No se pudo encontrar el proyecto con el ID solicitado. Compruebe el valor del encabezado X-Appwrite-Project para asegurarse de que se está utilizando el ID de proyecto correcto.

# webhook_not_found
source: Webhook with the requested ID could not be found.
es: No se pudo encontrar el webhook con el ID solicitado.

# key_not_found
source: Key with the requested ID could not be found.
es: No se pudo encontrar la clave con el ID solicitado.

# platform_not_found
source: Platform with the requested ID could not be found.
es: No se pudo encontrar la plataforma con el ID solicitado.

# domain_not_found
source: Domain with the requested ID could not be found.
es: No se pudo encontrar el dominio con el ID solicitado.

# variable_not_found
source: Variable with the requested ID could not be found.
es: No se pudo encontrar la variable con el ID solicitado.

# user_already_exists
source: A user with the same email already exists in your project.
es: Ya existe un usuario con el mismo correo electrónico en su proyecto.

# user_email_already_exists
source: A user with the same email already exists in the current project.
es: Ya existe un usuario con el mismo correo electrónico en el proyecto actual.

# user_phone_already_exists
source: A user with the same phone number already exists in the current project.
es: Ya existe un usuario con el mismo número de teléfono en el proyecto actual.

# team_invite_already_exists
source: User has already been invited or is already a member of this team
es: El usuario ya ha sido invitado o ya es miembro de este equipo

source: Membership already confirmed
es: Membresía ya confirmada

# storage_bucket_already_exists
source: A storage bucket with the requested ID already exists.
es: Ya existe un depósito de almacenamiento con el ID solicitado.

source: Database already exists
es: La base de datos ya existe

# collection_already_exists
source: A collection with the requested ID already exists.
es: Ya existe una colección con el ID solicitado.

# document_already_exists
source: Document with the requested ID already exists.
es: El documento con el ID solicitado ya existe.

# attribute_already_exists
source: Attribute with the requested ID already exists.
es: El atributo con el ID solicitado ya existe.

# index_already_exists
source: Index with the requested ID already exists.
es: El índice con el ID solicitado ya existe.

# domain_already_exists
source: A Domain with the requested ID already exists.
es: Ya existe un Dominio con el ID solicitado.

# variable_already_exists
source: Variable with the same ID already exists in your project.
es: Ya existe una variable con el mismo ID en su proyecto.

# user_password_reset_required
source: The current user requires a password reset.
es: El usuario actual requiere un restablecimiento de contraseña.

# project_provider_disabled
source: The chosen OAuth provider is disabled. You can enable the OAuth provider using the Appwrite console.
es: El proveedor de OAuth elegido está deshabilitado. Puede habilitar el proveedor de OAuth mediante la consola de Appwrite.

# storage_invalid_range
source: The requested range is not satisfiable. Please check the value of the Range header.
es: El rango solicitado no es satisfactorio. Compruebe el valor del encabezado Rango.

# general_rate_limit_exceeded
source: Rate limit for the current endpoint has been exceeded. Please try again after some time.
es: Se ha excedido el límite de velocidad para el extremo actual. Vuelva a intentarlo después de un tiempo.

# general_unknown
source: An unknown error has occured. Please check the logs for more information.
es: Ha ocurrido un error desconocido. Consulte los registros para obtener más información.

# general_server_error
source: An internal server error occurred.
es: Ocurrió un error interno del servidor.

# general_protocol_unsupported
source: The request cannot be fulfilled with the current protocol. Please check the value of the _APP_OPTIONS_FORCE_HTTPS environment variable.
es: La solicitud no se puede cumplir con el protocolo actual. Verifique el valor de la variable de entorno _APP_OPTIONS_FORCE_HTTPS.

# user_count_exceeded
source: The current project has exceeded the maximum number of users. Please check your user limit in the Appwrite console.
es: El proyecto actual ha superado el número máximo de usuarios. Verifique su límite de usuarios en la consola de Appwrite.

# user_auth_method_unsupported
source: The requested authentication method is either disabled or unsupported. Please check the supported authentication methods in the Appwrite console.
es: El método de autenticación solicitado está deshabilitado o no es compatible. Verifique los métodos de autenticación admitidos en la consola de Appwrite.

# project_provider_unsupported
source: The chosen OAuth provider is unsupported. Please check the docs for the complete list of supported OAuth providers.
es: El proveedor de OAuth elegido no es compatible. Consulte los documentos para ver la lista completa de proveedores de OAuth admitidos.

# general_service_disabled
source: The requested service is disabled. You can enable the service from the Appwrite console.
es: El servicio solicitado está deshabilitado. Puede habilitar el servicio desde la consola de Appwrite.

# general_smtp_disabled
source: SMTP is disabled on your Appwrite instance. You can learn more about setting up SMTP in our docs.
es: SMTP está deshabilitado en su instancia de Appwrite. Puede obtener más información sobre cómo configurar SMTP en nuestros documentos.

# general_phone_disabled
source: Phone provider is not configured. Please check the _APP_SMS_PROVIDER environment variable of your Appwrite server.
es: El proveedor de telefonía no está configurado. Verifique la variable de entorno _APP_SMS_PROVIDER de su servidor Appwrite.

source: Cache error
es: Error en cache

# no_internet_connection
source: You don't have internet connection
es: No tienes conexión a internet

# defaulT
source: Unidentified error
es: Error no identificado
